# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

age = 18
stroka = 'Привет'
name = input('Введите свое имя: ')
print(stroka + ' ' + name)

